Revit 2026 API

# FamilyType Class

---

The family type object provides read access to the values of family parameters for this type.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBFamilyType

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FamilyType : APIObject
```
```vb
Public Class FamilyType
	Inherits APIObject
```
```cpp
public ref class FamilyType : public APIObject
```
```fsharp
type FamilyType =
    class
        inherit APIObject
    end
```

The FamilyType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Name | The name of the family type. |

|  | Name | Description |
| --- | --- | --- |
|  | AsDouble | Provides access to the double precision number of the given family parameter. |
|  | AsElementId | Provides access to the Autodesk::Revit::DB::ElementId^ stored in the given family parameter. |
|  | AsInteger | Provides access to the integer number of the given family parameter. |
|  | AsString | Provides access to the string contents of the given family parameter. |
|  | AsValueString | Provides access to value as a string with unit in the given family parameter. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | HasValue | Indicates if this family parameter has an assigned value or not. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace